Table of Contents
 Class IdeaConcreteBlock
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaConcreteBlock : AbstractIdeaObject<IIdeaConcreteBlock>, IEquatable<AbstractIdeaObject<IIdeaConcreteBlock>>, IIdeaConcreteBlock, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaConcreteBlock>
IdeaConcreteBlock
Implements
IEquatable<AbstractIdeaObject<IIdeaConcreteBlock>>
IIdeaConcreteBlock
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaConcreteBlock>.Id
 AbstractIdeaObject<IIdeaConcreteBlock>.Name
 AbstractIdeaObject<IIdeaConcreteBlock>.Identifier
 AbstractIdeaObject<IIdeaConcreteBlock>.GetHashCode()
 AbstractIdeaObject<IIdeaConcreteBlock>.Equals(object)
 AbstractIdeaObject<IIdeaConcreteBlock>.Equals(AbstractIdeaObject<IIdeaConcreteBlock>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaConcreteBlock(Identifier<IIdeaConcreteBlock>)
public IdeaConcreteBlock(Identifier<IIdeaConcreteBlock> identifier)
Parameters
identifier Identifier<IIdeaConcreteBlock>
 IdeaConcreteBlock(string)
public IdeaConcreteBlock(string id)
Parameters
id string
Properties
 Height
Height
public double Height { get; set; }
Property Value
double
 Lenght
Lenght
public double Lenght { get; set; }
Property Value
double
 Material
Material of the concrete block.
public virtual IIdeaMaterial Material { get; set; }
Property Value
IIdeaMaterial
 Width
Width
public double Width { get; set; }
Property Value
double
 Edit this page